<img src="./unal.png" align=left width="150" height="150"></img>

$\;$
---


<h2 align="center">SQL</h2>

Pandas cuenta con una funcionalidad que facilita el acceso a tus bases de datos tipo SQL

---
### PostgreSQL
---

Para generar una conección a una base de datos **PosgreSQL**

In [1]:
import pandas as pd
import psycopg2

Luego creamos el elemento de conexión con el siguiente código:

In [5]:
sql_conn = psycopg2.connect(user = "usuario_consulta",
                            password = "etc123",
                            host = "127.0.0.1",
                            port = "5432",
                            database = "transporte")

Seguido simplemente definimos nuestra query en SQL:

In [11]:
query_sql = '''
select *
from pasajeros
limit 10
'''

Y creamos nuestro dataframe:

In [12]:
df = pd.read_sql(query_sql, sql_conn)
df.head(5)

   pasajero_id              nombre direccion_residencia fecha_nacimiento
0            1        Dre Dechelle           New Castle       2003-01-29
1            2         Fran Burnup               Rigney       2015-09-20
2            3      Muhammad Lowre             Arrowood       2008-11-08
3            4    Sapphire Rignall               Dakota       2001-03-19
4            5  Rosmunda Fishleigh             Sullivan       2006-03-08

---
### SQL Server
---

Para generar una conección a una base de datos **SQLServer**, es necesario de las librerias:

In [15]:
import pandas as pd
import pyodbc

Luego creamos el elemento de conexión con el siguiente código:

In [ ]:
driver = '{SQL Server}'
server_name = 'server_name'
db_name = 'database_name'
user = 'user'
password = 'password'
sql_conn = pyodbc.connect('''
DRIVER={};SERVER={};DATABASE={};UID={};PWD={};
Trusted_Connection=yes
'''.format(driver, server_name, db_name, user, password))

O si tienes el DSN:

In [ ]:
dsn = 'odbc_datasource_name'
sql_conn = pyodbc.connect('''
DSN={};UID={};PWD={};Trusted_Connection=yes;
'''.format(dsn, user, password))
Seguido simplemente definimos nuestra query en SQL:	
query_sql = 'select * from table_name limit 10'

Y creamos nuestro dataframe con:

In [ ]:
df = pd.read_sql(query_sql, sql_conn)
df.head(5)

---
### MySQL / Oracle / Otras 
---

Para generar una conección a una base de datos **MySQL**, es necesario de las librerias:

In [92]:
# !pip install mysqlclient        #En python3 se debe einstalar esta libreria
import pandas as pd
import sqlalchemy as sql

#Escogemos nuestra base de datos, Oracle, MySql o la de tu preferencia:
database_type = 'mysql'
#database_type = 'oracle'

Luego creamos el elemento de conexión con el siguiente código:

In [93]:
#!pip install mysql-connector-python

user = 'root'
password = 'tooR'
host = "127.0.0.1"
database = 'pruebaplatzi'

conn_string = '{}://{}:{}@{}/{}'.format(
database_type, user, password, host, database)

sql_conn = sql.create_engine(conn_string)

Seguido simplemente definimos nuestra query en SQL:

In [59]:
query_sql = '''
show databases
'''

In [80]:
query_sql = '''
use pruebaplatzi
'''

In [88]:
query_sql = '''
show tables
'''

In [94]:
query_sql = '''
select *
from authors
limit 10
'''

Y creamos nuestro dataframe con:

In [95]:
df = pd.read_sql(query_sql, sql_conn)
df.head(5)

   author_id                name nationality
0          1          Sam Altman         USA
1          2         Freddy Vega         COL
2          3  Arthur Conan Doyle         GBR
3          4     Chuck Palahniuk         USA
4          5          Juan Rulfo         MEX

# Referencias

* !pip install psycopg2
* !pip install pymysql        #Para MySQL